Revit 2026 API

# DimensionEqualityLabelFormatting Methods

---

The DimensionEqualityLabelFormatting type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetFormatOptions | Gets the format options used to show the parameter value. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValidFormatOptions | Checks whether a FormatOptions object is valid for the LabelType. |
|  | SetFormatOptions | Sets the format options used to show the parameter value. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

DimensionEqualityLabelFormatting Class

Autodesk.Revit.DB Namespace